# 1) შექმენით 2 ცვლადი რომესლაც დაწერთ `number_1` და `number_2`
#    დაწერეთ ამ რიცხვების:
#        `სხვაობა`
#        `განაყოფი(წილადით)`
#        `განაყოფი(ათწილადით)`
#        `ნამრავლი`
#        `ჯამი`

# *****

namber_1 = 30

namber_2 = 3


print(namber_1 - namber_2)
print(namber_1 / namber_2)
print(namber_1 // namber_2)
print(namber_1 * namber_2)
print(namber_1 + namber_2)


# 2) ახსენით კომენტარების საშულებით რა არის ლოგიკური ოპერატორი
# 3) შექმენით ცვლადი რომელსაც დაარქმენვთ ისეთ სახელს რომლის დროსაც `ადამიანი დადის` True ან False -ს მნიშვნელობას მიანიჭებდით
 
# 4) გამოიყენეთ if else და შეასრულეთ შემდეგი პირობა: თუ ცვლაიდი True -ს ტოლია გამოვიტანოთ ტერმინალში 'სიმართლე' თუ False ამ შემთხვევაში 'ტყუილი' სხვა შემთხვევაში არ არის მნიშვნელობა გადმოცემული
# 5) გაკვეთილის ბოლოს ვისწავლეთ `სტრინგებზე` გამავლება
# გამოიტანეთ ტერმინალში
# *
# ***
is_walk= True

if is_walk :
    print("ადამიანე დადის")

else :
    print("არ დადის")

is_True= False
if is_True:
    print("სიმართლე")

else :
    print("ტყუილი")

