# დავალება 1: მონაცემთა ტიპები და საბაზისო არითმეტიკა (int, float, +, )
# შექმენი ორი მთელი რიცხვის (int) ცვლადი: x = 12 და y = 5.

# შექმენი ერთი ათწილადის (float) ცვლადი: z = 2.5.

# გამოთვალე მათი ჯამი (x + y) და ნამრავლი (y z), შეინახე ახალ ცვლადებში და გამოიტანე ეკრანზე ტექსტით (მაგალითად: „ჯამი არის: ...“)


# დავალება 2: გაყოფა, მთელი ნაწილი და ნაშთი (/, //, %) (Advanded)
# შექმენი ცვლადი total_seconds = 4500.

# გამოიყენე მთელი ნაწილის გამოსაყოფი გაყოფა (//), რომ გაიგო რამდენი სრული წუთია ამ წამებში (გაყავი 60-ზე) და შეინახე ცვლადში minutes.

# გამოიყენე ნაშთიანი გაყოფა (%), რომ გაიგო რამდენი წამი რჩება ნაშთად და შეინახე ცვლადში seconds.

# დაბეჭდე შედეგი string ფორმატით (მაგ: „4500 წამი არის 75 წუთი და 0 წამი“).
d

# დავალება 3: ხარისხში აყვანა და ცვლადის განახლება ()
# შექმენი ცვლადი number = 3 და მიანიჭე მნიშვნელობა.

# აიყვანე ეს რიცხვი კუბში (მე-3 ხარისხში, გამოიყენე ) და განაახლე number ცვლადის მნიშვნელობა.

# მიღებულ შედეგს გამოაკელი 5 და ისევ განაახლე number ცვლადი.

# დაბეჭდე საბოლოო მნიშვნელობა და შეამოწმე მისი ტიპი type() ფუნქციის გამოყენებით.

# /// type() კი არ გივსწავლია მაგრამ გამოიყენეთ უბრალოდ ძალიან მარტივია და კომენტარებით ახსენით რას აკეთებს

# დავალება 4: ლოგიკური ტიპი და შედარება (bool)
# შექმენი ცვლადი score = 78.

# შექმენი ლოგიკური (bool) ცვლადი is_passe, რომლის მნიშვნელობაც იქნება True ან False: 
# თუ არა score მეტი ან ტოლი 50-ზე მაშინ score მა შეიცვალოს მნიშნვნელობა და მიიღოს 50

# დავალება 5: მინი-პროექტი (ტიპების და ოპერატორების კომბინაცია)
# შექმენი შემდეგი ცვლადები:

# item_name = „ყავა“ (string)

# price = 4.50 (float)

# quantity = 3 (int)

# გამოთვალე ჯამური ღირებულება (* ოპერატორით) და შეინახე ცვლადში total_cost.

# შექმენი ფასდაკლების პირობა: თუ ჯამური ღირებულება მეტია 10-ზე, მიანიჭე has_discount = True (სხვა შემთხვევაში False).

# გამოიტანე ეკრანზე სრული ინფორმაცია ერთმანეთის მიყოლებით (პროდუქტი, რაოდენობა, ჯამი და ფასდაკლების სტატუსი).


x = 12
y = 5
z = 2.5

print("ჯამი არის", x + y )
print("ნამრავლი არის",y * z )


total_seconds = 4500

minutes = total_seconds // 60

second = total_seconds % 60

print("4500 წამი არის 750 წუთი და 0 წამი")

number = 3

print(number ** 3)

number = 4

print(number ** 3 - 5)

number = 5

score = 78
is_passe = True

if is_passe >= score :
    print(50)