# 1) შევქმანთ ცვლადები num_1 da num_2
# მათ მივანიჭოთ რაიმე ციფრის მნიშნვლოებობა
# 2) გამოვიტანოთ ტერმინლაში ამ ორი ციფრის:
# ნამრავლი
# სხვაობა


num_1 = 10
num_2 = 2
print(num_1 * num_2)
print(num_1 - num_2)

# 1) რას დავაქმევთ ცვლადს  სახელს იმ შემთხვევაში თუ მოთამაშე აწვება კლავიატურზე ღილაკს

# 2) დარქმეული ცვლადით დავწეროთ ლოგიკა სადაც თუ დააწვება გამოგვიტანოს ტერმინალში დააწვა ღილაკს
# თუ არ დააწვება მაგ შემთხვევაში არ დააწვა 


is_pres =  True 
if is_pres :
    print("დაეჭიროს") 

else :
    print(" არ დაეჭიროს") 



